In [2]:
from pyspark.sql import SparkSession

spark=SparkSession.builder.master("local").appName("test").getOrCreate()

data=[
      (10,'ACCOUNTING','NEW YORK'),
(20,'RESEARCH','DALLAS'),
(30,'SALES','CHICAGO'),
(40,'OPERATIONS','BOSTON')
      ]
columns=["Deptno","Dname","Loc"]
df=spark.createDataFrame(data=data, schema=columns)

print(df.printSchema())

df.head(2)

root
 |-- Deptno: long (nullable = true)
 |-- Dname: string (nullable = true)
 |-- Loc: string (nullable = true)

None

[Row(Deptno=10, Dname='ACCOUNTING', Loc='NEW YORK'),
 Row(Deptno=20, Dname='RESEARCH', Loc='DALLAS')]

In [3]:
from pyspark.sql.types import StringType, FloatType, StructType, StructField, DateType, IntegerType

header=["EMPNO","ENAME","JOB","MGR","HIREDATE","SAL","COMM","DEPTNO","UPDATED_DATE"]
data_emp = map(lambda r:(r[0],r[1],r[2],r[3],r[4],r[5],r[6],r[7],r[8]),
           map(lambda x:x.split(","),
["7369,SMITH,CLERK,7902,17-12-1980,800,null,20,2022-01-01",
"7499,ALLEN,SALESMAN,7698,20-02-1981,1600,300,30,2022-01-01",
"7521,WARD,SALESMAN,7698,22-02-1981,1250,500,30,2022-01-01",
"7566,JONES,MANAGER,7839,04-02-1981,2975,null,20,2022-01-05",
"7654,MARTIN,SALESMAN,7698,21-09-1981,1250,1400,30,2022-01-03",
"7698,SGR,MANAGER,7839,05-01-1981,2850,null,30,2022-01-04",
"7782,RAVI,MANAGER,7839,06-09-1981,2450,null,10,2022-01-02",
"7788,SCOTT,ANALYST,7566,19-04-1987,3000,null,20,2022-01-02",
"7839,KING,PRESIDENT,null,01-11-1981,5000,null,10,2022-01-02",
"7844,TURNER,SALESMAN,7698,09-08-1981,1500,0,30,2022-01-02",
"7876,ADAMS,CLERK,7788,23-05-1987,1100,null,20,2022-01-03",
"7900,JAMES,CLERK,7698,12-03-1981,950,null,30,2022-01-03",
"7902,FORD,ANALYST,7566,12-03-1981,3000,null,20,2022-01-03",
"7934,MILLER,CLERK,7782,01-03-1982,1300,null,10,2022-01-03",
"1234,SEKHAR,doctor,7777,null,667,78,80,2022-01-03",
"7369,SMITH,CLERK,7902,17-12-1980,800,null,20,2022-01-04",
"7499,ALLEN,SALESMAN,7698,20-02-1981,1600,300,30,2022-01-04",
"7521,WARD,SALESMAN,7698,22-02-1981,1250,500,30,2022-01-04",
"7566,JONES,MANAGER,7839,04-02-1981,2975,null,20,2022-01-04",
"7654,MARTIN,SALESMAN,7698,21-09-1981,1250,1400,30,2022-01-05",
"7698,SGR,MANAGER,7839,05-01-1981,2850,null,30,2022-01-05",
"7782,RAVI,MANAGER,7839,06-09-1981,2450,null,10,2022-01-05",
"7788,SCOTT,ANALYST,7566,19-04-1987,3000,null,20,2022-01-06",
"7839,KING,PRESIDENT,null,01-11-1981,5000,null,10,2022-01-06",
"7844,TURNER,SALESMAN,7698,09-08-1981,1500,0,30,2022-01-06",
"7876,ADAMS,CLERK,7788,23-05-1987,1100,null,20,2022-01-06",
"7900,JAMES,CLERK,7698,12-03-1981,950,null,30,2022-01-07",
"7902,FORD,ANALYST,7566,12-03-1981,3000,null,20,2022-01-07",
"7934,MILLER,CLERK,7782,01-03-1982,1300,null,10,2022-01-07",
"1234,RAM,CLERK,7457,null,494,588,80,2022-01-07"
]))

schema=StructType([
    StructField("empno",StringType(),nullable=True),
    StructField("ename",StringType(),nullable=True),
    StructField("job",StringType(),nullable=False),
    StructField("mgr",StringType(),nullable=False),
    StructField("hiredate",StringType(),nullable=False),
    StructField("sal",StringType(),nullable=True),
    StructField("comm",StringType(),nullable=False),
    StructField("deptno",StringType(),nullable=True),
    StructField("update_date",StringType(),nullable=False)
])

df_emp=spark.createDataFrame(data_emp, schema=schema)

df_emp.show()
#df_emp.printSchema()

+-----+------+---------+----+----------+----+----+------+-----------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|update_date|
+-----+------+---------+----+----------+----+----+------+-----------+
| 7369| SMITH|    CLERK|7902|17-12-1980| 800|null|    20| 2022-01-01|
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600| 300|    30| 2022-01-01|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250| 500|    30| 2022-01-01|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|null|    20| 2022-01-05|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|1400|    30| 2022-01-03|
| 7698|   SGR|  MANAGER|7839|05-01-1981|2850|null|    30| 2022-01-04|
| 7782|  RAVI|  MANAGER|7839|06-09-1981|2450|null|    10| 2022-01-02|
| 7788| SCOTT|  ANALYST|7566|19-04-1987|3000|null|    20| 2022-01-02|
| 7839|  KING|PRESIDENT|null|01-11-1981|5000|null|    10| 2022-01-02|
| 7844|TURNER| SALESMAN|7698|09-08-1981|1500|   0|    30| 2022-01-02|
| 7876| ADAMS|    CLERK|7788|23-05-1987|1100|null|    20| 2022-01-03|
| 7900| JAMES|    CLERK|7698|12-03-1981| 950|null|    30| 2022-01-03|
| 7902|  FORD|  ANALYST|7566|12-03-1981|3000|null|    20| 2022-01-03|
| 7934|MILLER|    CLERK|7782|01-03-1982|1300|null|    10| 2022-01-03|
| 1234|SEKHAR|   doctor|7777|      null| 667|  78|    80| 2022-01-03|
| 7369| SMITH|    CLERK|7902|17-12-1980| 800|null|    20| 2022-01-04|
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600| 300|    30| 2022-01-04|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250| 500|    30| 2022-01-04|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|null|    20| 2022-01-04|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|1400|    30| 2022-01-05|
+-----+------+---------+----+----------+----+----+------+-----------+
only showing top 20 rows

In [4]:
header=["city","type","price"]
data=map(lambda r:(r[0], r[1], float(r[2])),
         map(lambda x:x.split(","),
            ["Paris,Food,19.0","Marseille,Clothing,12.00",
             "Paris,Food,8.00","Paris,Cloting,15.00",
             "Marseille,Food,20.00","Lyon,Book,10.00"
            ]))
df=spark.createDataFrame(data, header)
df.collect()

[Row(city='Paris', type='Food', price=19.0),
 Row(city='Marseille', type='Clothing', price=12.0),
 Row(city='Paris', type='Food', price=8.0),
 Row(city='Paris', type='Cloting', price=15.0),
 Row(city='Marseille', type='Food', price=20.0),
 Row(city='Lyon', type='Book', price=10.0)]

In [22]:
df.take(2)

[Row(city='Paris', type='Food', price=19.0),
 Row(city='Marseille', type='Clothing', price=12.0)]

In [24]:
df.printSchema()

root
 |-- city: string (nullable = true)
 |-- type: string (nullable = true)
 |-- price: double (nullable = true)

In [26]:
df.dtypes

[('city', 'string'), ('type', 'string'), ('price', 'double')]

In [15]:
from pyspark.sql.types import StringType, FloatType, StructType, StructField

data=map(lambda r:(r[0], r[1], float(r[2])),
         map(lambda x:x.split(","),
            ["Paris,Food,19.0","Marseille,Clothing,12.00",
             "Paris,Food,8.00","Paris,Cloting,15.00",
             "Marseille,Food,20.00","Lyon,Book,10.00"
            ]))
schema=StructType(
        [ StructField("city",StringType(),nullable=True),
        StructField("type",StringType(),nullable=True),
        StructField("price",FloatType(),nullable=False),
            
        ])
df=spark.createDataFrame(data,schema=schema)
df.show()

+---------+--------+-----+
|     city|    type|price|
+---------+--------+-----+
|    Paris|    Food| 19.0|
|Marseille|Clothing| 12.0|
|    Paris|    Food|  8.0|
|    Paris| Cloting| 15.0|
|Marseille|    Food| 20.0|
|     Lyon|    Book| 10.0|
+---------+--------+-----+

In [5]:
df.select("city").show()

+---------+
|     city|
+---------+
|    Paris|
|Marseille|
|    Paris|
|    Paris|
|Marseille|
|     Lyon|
+---------+

In [6]:
df.select("city","type").show()

+---------+--------+
|     city|    type|
+---------+--------+
|    Paris|    Food|
|Marseille|Clothing|
|    Paris|    Food|
|    Paris| Cloting|
|Marseille|    Food|
|     Lyon|    Book|
+---------+--------+

# Filter

In [7]:
df.filter(df.city=='Paris').show()

+-----+-------+-----+
| city|   type|price|
+-----+-------+-----+
|Paris|   Food| 19.0|
|Paris|   Food|  8.0|
|Paris|Cloting| 15.0|
+-----+-------+-----+

In [8]:
df.filter(df.city=='Paris').filter(df.type=='Food').show()

+-----+----+-----+
| city|type|price|
+-----+----+-----+
|Paris|Food| 19.0|
|Paris|Food|  8.0|
+-----+----+-----+

In [59]:
df.filter((df.city=='Paris') & (df.type=='Food')).show()

+-----+----+-----+
| city|type|price|
+-----+----+-----+
|Paris|Food| 19.0|
|Paris|Food|  8.0|
+-----+----+-----+

In [9]:
df.filter((df.city=='Paris') & (df.price > 18.0)).select('city').show()

+-----+
| city|
+-----+
|Paris|
+-----+

In [10]:
df.filter(df.price < 15).orderBy(df.price.asc()).select("city","price").show()

+---------+-----+
|     city|price|
+---------+-----+
|    Paris|  8.0|
|     Lyon| 10.0|
|Marseille| 12.0|
+---------+-----+

In [11]:
df_emp.filter(df_emp.job!='CLERK').show()

+-----+------+---------+----+----------+----+----+------+-----------+
|empno| ename|      job| mgr|  hiredate| sal|comm|deptno|update_date|
+-----+------+---------+----+----------+----+----+------+-----------+
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600| 300|    30| 2022-01-01|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250| 500|    30| 2022-01-01|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|null|    20| 2022-01-05|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|1400|    30| 2022-01-03|
| 7698|   SGR|  MANAGER|7839|05-01-1981|2850|null|    30| 2022-01-04|
| 7782|  RAVI|  MANAGER|7839|06-09-1981|2450|null|    10| 2022-01-02|
| 7788| SCOTT|  ANALYST|7566|19-04-1987|3000|null|    20| 2022-01-02|
| 7839|  KING|PRESIDENT|null|01-11-1981|5000|null|    10| 2022-01-02|
| 7844|TURNER| SALESMAN|7698|09-08-1981|1500|   0|    30| 2022-01-02|
| 7902|  FORD|  ANALYST|7566|12-03-1981|3000|null|    20| 2022-01-03|
| 1234|SEKHAR|   doctor|7777|      null| 667|  78|    80| 2022-01-03|
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600| 300|    30| 2022-01-04|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250| 500|    30| 2022-01-04|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|null|    20| 2022-01-04|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|1400|    30| 2022-01-05|
| 7698|   SGR|  MANAGER|7839|05-01-1981|2850|null|    30| 2022-01-05|
| 7782|  RAVI|  MANAGER|7839|06-09-1981|2450|null|    10| 2022-01-05|
| 7788| SCOTT|  ANALYST|7566|19-04-1987|3000|null|    20| 2022-01-06|
| 7839|  KING|PRESIDENT|null|01-11-1981|5000|null|    10| 2022-01-06|
| 7844|TURNER| SALESMAN|7698|09-08-1981|1500|   0|    30| 2022-01-06|
+-----+------+---------+----+----------+----+----+------+-----------+
only showing top 20 rows

In [12]:
df.filter(df.price < 15).sort(df.price.asc()).select("city","price").show()

+---------+-----+
|     city|price|
+---------+-----+
|    Paris|  8.0|
|     Lyon| 10.0|
|Marseille| 12.0|
+---------+-----+

Manipulating Columns

In [13]:
from pyspark.sql.functions import lit, rand

df=df.withColumn("Six",lit(6)).show()

+---------+--------+-----+---+
|     city|    type|price|Six|
+---------+--------+-----+---+
|    Paris|    Food| 19.0|  6|
|Marseille|Clothing| 12.0|  6|
|    Paris|    Food|  8.0|  6|
|    Paris| Cloting| 15.0|  6|
|Marseille|    Food| 20.0|  6|
|     Lyon|    Book| 10.0|  6|
+---------+--------+-----+---+

In [21]:
from pyspark.sql.types import StructType,StructField,StringType,FloatType

data=map(lambda r:(r[0], r[1], float(r[2])),
         map(lambda x:x.split(","),
            ["Paris,Food,19.0","Marseille,Clothing,12.00",
             "Paris,Food,8.00","Paris,Cloting,15.00",
             "Marseille,Food,20.00","Lyon,Book,10.00"
            ]))

schema=StructType(
    [StructField('city', StringType(),nullable=True),
    StructField('type',StringType(),nullable=True),
    StructField('price',FloatType(),nullable=True),
    ]
    )

df=spark.createDataFrame(data=data, schema=schema)
df=df.withColumn("50percent",df.price / 2).show()

+---------+--------+-----+---------+
|     city|    type|price|50percent|
+---------+--------+-----+---------+
|    Paris|    Food| 19.0|      9.5|
|Marseille|Clothing| 12.0|      6.0|
|    Paris|    Food|  8.0|      4.0|
|    Paris| Cloting| 15.0|      7.5|
|Marseille|    Food| 20.0|     10.0|
|     Lyon|    Book| 10.0|      5.0|
+---------+--------+-----+---------+

# DROPPING COLUMNS ---

In [24]:
df_emp.drop(df_emp.comm).show()

+-----+------+---------+----+----------+----+------+-----------+
|empno| ename|      job| mgr|  hiredate| sal|deptno|update_date|
+-----+------+---------+----+----------+----+------+-----------+
| 7369| SMITH|    CLERK|7902|17-12-1980| 800|    20| 2022-01-01|
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600|    30| 2022-01-01|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250|    30| 2022-01-01|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|    20| 2022-01-05|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|    30| 2022-01-03|
| 7698|   SGR|  MANAGER|7839|05-01-1981|2850|    30| 2022-01-04|
| 7782|  RAVI|  MANAGER|7839|06-09-1981|2450|    10| 2022-01-02|
| 7788| SCOTT|  ANALYST|7566|19-04-1987|3000|    20| 2022-01-02|
| 7839|  KING|PRESIDENT|null|01-11-1981|5000|    10| 2022-01-02|
| 7844|TURNER| SALESMAN|7698|09-08-1981|1500|    30| 2022-01-02|
| 7876| ADAMS|    CLERK|7788|23-05-1987|1100|    20| 2022-01-03|
| 7900| JAMES|    CLERK|7698|12-03-1981| 950|    30| 2022-01-03|
| 7902|  FORD|  ANALYST|7566|12-03-1981|3000|    20| 2022-01-03|
| 7934|MILLER|    CLERK|7782|01-03-1982|1300|    10| 2022-01-03|
| 1234|SEKHAR|   doctor|7777|      null| 667|    80| 2022-01-03|
| 7369| SMITH|    CLERK|7902|17-12-1980| 800|    20| 2022-01-04|
| 7499| ALLEN| SALESMAN|7698|20-02-1981|1600|    30| 2022-01-04|
| 7521|  WARD| SALESMAN|7698|22-02-1981|1250|    30| 2022-01-04|
| 7566| JONES|  MANAGER|7839|04-02-1981|2975|    20| 2022-01-04|
| 7654|MARTIN| SALESMAN|7698|21-09-1981|1250|    30| 2022-01-05|
+-----+------+---------+----+----------+----+------+-----------+
only showing top 20 rows

In [27]:
df_emp.drop(*["update_date","mdg","comm"]).filter(df_emp.deptno=='20').show()

+-----+-----+-------+----+----------+----+------+
|empno|ename|    job| mgr|  hiredate| sal|deptno|
+-----+-----+-------+----+----------+----+------+
| 7369|SMITH|  CLERK|7902|17-12-1980| 800|    20|
| 7566|JONES|MANAGER|7839|04-02-1981|2975|    20|
| 7788|SCOTT|ANALYST|7566|19-04-1987|3000|    20|
| 7876|ADAMS|  CLERK|7788|23-05-1987|1100|    20|
| 7902| FORD|ANALYST|7566|12-03-1981|3000|    20|
| 7369|SMITH|  CLERK|7902|17-12-1980| 800|    20|
| 7566|JONES|MANAGER|7839|04-02-1981|2975|    20|
| 7788|SCOTT|ANALYST|7566|19-04-1987|3000|    20|
| 7876|ADAMS|  CLERK|7788|23-05-1987|1100|    20|
| 7902| FORD|ANALYST|7566|12-03-1981|3000|    20|
+-----+-----+-------+----+----------+----+------+

# Renaming Column

In [39]:
df_emp.withColumnRenamed("ename","Employee_name").drop(*["update_date","mdg","comm"]).filter(df_emp.sal > 1500).show()

+-----+-------------+---------+----+----------+----+------+
|empno|Employee_name|      job| mgr|  hiredate| sal|deptno|
+-----+-------------+---------+----+----------+----+------+
| 7499|        ALLEN| SALESMAN|7698|20-02-1981|1600|    30|
| 7566|        JONES|  MANAGER|7839|04-02-1981|2975|    20|
| 7698|          SGR|  MANAGER|7839|05-01-1981|2850|    30|
| 7782|         RAVI|  MANAGER|7839|06-09-1981|2450|    10|
| 7788|        SCOTT|  ANALYST|7566|19-04-1987|3000|    20|
| 7839|         KING|PRESIDENT|null|01-11-1981|5000|    10|
| 7902|         FORD|  ANALYST|7566|12-03-1981|3000|    20|
| 7499|        ALLEN| SALESMAN|7698|20-02-1981|1600|    30|
| 7566|        JONES|  MANAGER|7839|04-02-1981|2975|    20|
| 7698|          SGR|  MANAGER|7839|05-01-1981|2850|    30|
| 7782|         RAVI|  MANAGER|7839|06-09-1981|2450|    10|
| 7788|        SCOTT|  ANALYST|7566|19-04-1987|3000|    20|
| 7839|         KING|PRESIDENT|null|01-11-1981|5000|    10|
| 7902|         FORD|  ANALYST|7566|12-03-1981|3000|    20|
+-----+-------------+---------+----+----------+----+------+

# Advanced Manipulations

In order to respond to most situations, PySpark already has a number of pre-implemented functions present in the pyspark.sql.functions module
The functions are numerous and of all types, Do not hesitate to refer to it.
Mathematical functions(cos,sin,tan,abs,exp,log ...)
Dataframes manipulation(Concatenate, repartitioning,Structure manipulation....)
Statistics (avarage, variance, correlation, covariance ..)
Date manipulation.
Operators of relational algebra

In [34]:
from pyspark.sql.functions import cos

df=spark.createDataFrame(
[[1,2],[2,3],[3,4],[4,5]],
schema=["x1","x2"])

df=df.withColumn("cos_num",cos(df.x1 + df.x2)).show()

+---+---+-------------------+
| x1| x2|            cos_num|
+---+---+-------------------+
|  1|  2|-0.9899924966004454|
|  2|  3|0.28366218546322625|
|  3|  4| 0.7539022543433046|
|  4|  5|-0.9111302618846769|
+---+---+-------------------+

In [5]:
from pyspark.sql.types import IntegerType

df=df_emp.withColumn("sal",df_emp.sal.cast('int')).groupBy("deptno").sum("sal").orderBy("deptno").show(truncate=False)

+------+--------+
|deptno|sum(sal)|
+------+--------+
|10    |17500   |
|20    |21750   |
|30    |18800   |
|80    |1161    |
+------+--------+

In [6]:
df_emp.groupBy("deptno").count().withColumnRenamed("count","dept count").select("deptno","dept count").orderBy("deptno").show()

+------+----------+
|deptno|dept count|
+------+----------+
|    10|         6|
|    20|        10|
|    30|        12|
|    80|         2|
+------+----------+

In [10]:
df_emp.groupBy("deptno").mean().show()

+------+
|deptno|
+------+
|    30|
|    20|
|    10|
|    80|
+------+

# UDF in Pyspark

In [18]:
from pyspark.sql.functions import udf

@udf("float")  # Decorator to define an UDF to return  an float

def add_3(x):
    return x*3

In [20]:
df.select(add_3(df.price).alias('Price_hike')).show()

+----------+
|Price_hike|
+----------+
|      57.0|
|      36.0|
|      24.0|
|      45.0|
|      60.0|
|      30.0|
+----------+

# Pandas to pySpark and vice Versa

In [31]:
header=["city","type","price"]
data=map(lambda r:(r[0], r[1], float(r[2])),
         map(lambda x:x.split(","),
            ["Paris,Food,19.0","Marseille,Clothing,12.00",
             "Paris,Food,8.00","Paris,Cloting,15.00",
             "Marseille,Food,20.00","Lyon,Book,10.00"
            ]))
df=spark.createDataFrame(data, header)
df.collect()

[Row(city='Paris', type='Food', price=19.0),
 Row(city='Marseille', type='Clothing', price=12.0),
 Row(city='Paris', type='Food', price=8.0),
 Row(city='Paris', type='Cloting', price=15.0),
 Row(city='Marseille', type='Food', price=20.0),
 Row(city='Lyon', type='Book', price=10.0)]

In [32]:
df.show()

+---------+--------+-----+
|     city|    type|price|
+---------+--------+-----+
|    Paris|    Food| 19.0|
|Marseille|Clothing| 12.0|
|    Paris|    Food|  8.0|
|    Paris| Cloting| 15.0|
|Marseille|    Food| 20.0|
|     Lyon|    Book| 10.0|
+---------+--------+-----+

In [34]:
import pandas as pd

df_pd=df.toPandas()
df_pd

        city      type  price
0      Paris      Food   19.0
1  Marseille  Clothing   12.0
2      Paris      Food    8.0
3      Paris   Cloting   15.0
4  Marseille      Food   20.0
5       Lyon      Book   10.0

# Pandas to Pyspark

In [36]:
from pyspark.sql import SQLContext
from pyspark.sql import SparkSession

spark=SparkSession.builder.master("local").appName("Pyspark-Skyhigh").getOrCreate()
sqlctx=SQLContext(spark)

sqlctx.createDataFrame(df_pd).show()

+---------+--------+-----+
|     city|    type|price|
+---------+--------+-----+
|    Paris|    Food| 19.0|
|Marseille|Clothing| 12.0|
|    Paris|    Food|  8.0|
|    Paris| Cloting| 15.0|
|Marseille|    Food| 20.0|
|     Lyon|    Book| 10.0|
+---------+--------+-----+

# Removing null Rows (udf)

In [41]:
from pyspark.sql import SQLContext

sqlctx=SQLContext(spark)

df=sqlctx.createDataFrame([
    [10,'ACCOUNTING','NEW YORK'],
    [20,'RESEARCH','DALLAS'],
    [30,'SALES','CHICAGO'],
    [40,'OPERATIONS','BOSTON'],
    [50,'MARKETING',''],
    [20,'FINANCE','']
    ],
    ['deptno','dname','Loc']
)

df.show()

+------+----------+--------+
|deptno|     dname|     Loc|
+------+----------+--------+
|    10|ACCOUNTING|NEW YORK|
|    20|  RESEARCH|  DALLAS|
|    30|     SALES| CHICAGO|
|    40|OPERATIONS|  BOSTON|
|    50| MARKETING|        |
|    20|   FINANCE|        |
+------+----------+--------+

In [64]:
from pyspark.sql.functions import udf

def remove_null(x):
    if x=='':
        return 1
    else:
        return 0
    

# Note
udfValueCategory=udf(remove_null,IntegerType())
df1=df.withColumn("category",udfValueCategory("loc").cast(IntegerType())).show()

+------+----------+--------+--------+
|deptno|     dname|     Loc|category|
+------+----------+--------+--------+
|    10|ACCOUNTING|NEW YORK|       0|
|    20|  RESEARCH|  DALLAS|       0|
|    30|     SALES| CHICAGO|       0|
|    40|OPERATIONS|  BOSTON|       0|
|    50| MARKETING|        |       1|
|    20|   FINANCE|        |       1|
+------+----------+--------+--------+

In [65]:
#df1.filter(df1.category==0).show()
df1.select("category")

AttributeError: 'NoneType' object has no attribute 'select'

In [68]:
from pyspark.sql import SQLContext
from pyspark.sql import SparkSession

spark=SparkSession.builder.master("local").appName("Testing-SkyHigh").getOrCreate()
sqlctx=SQLContext(spark)

df=sqlctx.createDataFrame(
[
    (1,"a",23.0)
    ,(3,"B",-23.0)
],("x1","x2","x3")
)
df.show()

+---+---+-----+
| x1| x2|   x3|
+---+---+-----+
|  1|  a| 23.0|
|  3|  B|-23.0|
+---+---+-----+

In [69]:
def valuetoCategory(value):
    if value==1: return 'cat1'
    elif value==2: return 'cat2'
    else: return 'n/a'

#Note: if seems that calls to udf() must be after SparkContext() is called

udfcat=udf(valuetoCategory,StringType())
df_with_cat=df.withColumn("Category",udfcat("x1"))
df_with_cat.show()

+---+---+-----+--------+
| x1| x2|   x3|Category|
+---+---+-----+--------+
|  1|  a| 23.0|    cat1|
|  3|  B|-23.0|     n/a|
+---+---+-----+--------+